maze = [
    [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
    [9, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 9],
    [9, 0, 9, 0, 0, 0, 9, 9, 0, 9, 9, 9],
    [9, 0, 9, 9, 0, 9, 0, 0, 0, 9, 0, 9],
    [9, 0, 0, 0, 9, 0, 0, 9, 9, 0, 9, 9],
    [9, 9, 9, 0, 0, 9, 0, 9, 0, 0, 1, 9],
    [9, 0, 0, 0, 9, 0, 9, 0, 0, 9, 9, 9],
    [9, 0, 9, 0, 0, 0, 0, 9, 0, 0, 9, 9],
    [9, 0, 0, 9, 0, 9, 0, 0, 9, 0, 0, 9],
    [9, 0, 9, 0, 9, 0, 9, 0, 0, 9, 0, 9],
    [9, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 9],
    [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]
]

def search(x, y, depth):
    if maze[x][y] == 1:
        print(depth)
        exit()
    
    maze[x][y] = 2
    
    if maze[x-1][y] < 2:
        search(x-1, y, depth + 1)
    if maze[x+1][y] < 2:
        search(x+1, y, depth + 1)
    if maze[x][y-1] < 2:
        search(x, y-1, depth + 1)
    if maze[x][y+1] < 2:
        search(x, y+1, depth + 1)
    
    maze[x][y] = 0
    
search(1, 1, 0)
#분기점으로 돌아올때 방식은 리턴이 연속적으로 이루어지면서 수행됨.
#pos에 현재위치를 저장할 필요가 없는것이 이러한 이유 때문임.